package xuan.demo1helloworld;

public class Demo1 {
    public static void main(String[] args) {
        int count = 0;
        String[] arr1 = {"张恒", "陈豪", "万诚", "邹林志", "涂佼龙", "王冠", "王海旺", "罗德臻", "肖俊杰", "鲁文霞", "周志鹏", "陈宽", "刘磊", "李嘉善", "麦超源", "张振浩", "李伟炽", "黄彦肇", "周荣轩", "石家荣", "陈龙", "段俊宇", "龙杰", "曾晓建", "刘传燊", "韩广", "杨成林", "张明俊毅", "鲁天宇", "赵望", "赵永生"};
        System.out.println(arr1.length);
        String[] arr2 = {"张恒", "刘磊", "周志鹏", "周荣轩", "黄健青", "李城", "王冠", "林富城", "吴坤洲", "王志林", "刘炳泰", "熊正午", "刘传燊", "陈宽", "佘君恋", "任文波", "杨启志", "户宝华", "朱小军", "肖俊杰", "龙杰", "赵永生", "杜霖", "莫泽鑫", "石家荣", "涂佼龙", "王海旺", "张乙棚", "万诚", "赵品隽", "贺锋", "李嘉善", "周振", "李纤纤", "张儒辰", "何谦", "吴惠进", "杨泳佳", "罗德臻", "叶文强", "袁灵杰", "刘旭", "罗文超", "许进祥", "蒙开仕", "通启竣", "温子鸣", "韩广", "张振浩", "鲁天宇", "张靖", "梁华彬", "谢文峰", "陈龙", "张明俊毅", "李伟炽", "张鹏", "杨成林", "吴树浩", "赵望"};
        System.out.println(arr2.length);
        for (int i = 0; i < arr1.length; i++) {
            for (int j = 0; j < arr2.length; j++) {
                if (arr1[i].equals(arr2[j])) {
                    count++;
                }
            }
        }
        System.out.println("count = " + count);
    }
}
